app/controllers/acd_subjects_controller.rb

	def combo
		data=[]
		if !params[:course_id].nil?

			data =AcdCourseSubject.joins(:acd_subject
				).where(
					"is_deleted=#{false} and campus_id=#{session[:campus_id]} and acd_course_id=#{params[:course_id]}"
				).select('acd_subjects.*')
		else
			data = AcdSubject.where(campus_id:session[:campus_id])
---
SELECT `acd_subjects`.* FROM `acd_subjects`  WHERE `acd_subjects`.`campus_id` = 1