app/controllers/acd_batchs_controller.rb

	def index
        begin
            @data = AcdBatch.joins(:gen_campus).where(is_deleted: false )
---
SELECT  acd_batches.* , gen_campus.campus_name campus FROM `acd_batches` INNER JOIN `gen_campus` ON `gen_campus`.`id` = `acd_batches`.`gen_campus_id` WHERE `acd_batches`.`is_deleted` = 0 LIMIT 25 OFFSET 0

	def combo
        begin
    		data = AcdBatch.where(is_deleted:false,gen_campus_id:session[:campus_id])
---
SELECT `acd_batches`.* FROM `acd_batches`  WHERE `acd_batches`.`is_deleted` = 0 AND `acd_batches`.`gen_campus_id` = 1

	def create
        begin
            AcdBatch.transaction do
                if !AcdBatch.exists?(code: params[:data][:code],is_deleted:false)
                    @data = AcdBatch.new(permit_data)
                    @data.gen_campus_id=session[:campus_id]
                    @data.is_deleted =false
                    if @data.save
---
SELECT  1 AS one FROM `acd_batches`  WHERE `acd_batches`.`code` = '14' AND `acd_batches`.`is_deleted` = 0 LIMIT 1
INSERT INTO `acd_batches` (`code`, `created_at`, `gen_campus_id`, `is_deleted`, `khr_name`, `name`, `updated_at`) VALUES ('14', '2016-06-07 23:28:04', 1, 0, 'ជំនាន់ទី១៤', 'Batch 14 ', '2016-06-07 23:28:04')