app/controllers/acd_class_shift_controller.rb

	def combo
		begin
			data = AcdClassShift.all
---
SELECT `acd_class_shifts`.* FROM `acd_class_shifts`