app/controllers/acd_degrees_controller.rb

SELECT `acd_degrees`.* FROM `acd_degrees`  WHERE `acd_degrees`.`degree_type` = 'TC'
SELECT `acd_degrees`.* FROM `acd_degrees`
---
	def combo
		data =[]
		if !params[:type].nil?
			data =  AcdDegree.where(degree_type:params[:type])
		else
			data =AcdDegree.all