app/controllers/acd_terms_controller.rb

	def combo
		data = 	AcdTerm.where( is_deleted: false )
---
SELECT `acd_terms`.* FROM `acd_terms`  WHERE `acd_terms`.`is_deleted` = 0