app/controllers/acd_course_controller.rb

SELECT acd_course_faculties.* FROM `acd_degree_courses` INNER JOIN `acd_course_faculties` ON `acd_course_faculties`.`id` = `acd_degree_courses`.`course_id` WHERE (acd_course_faculties.course_type='TC')
SELECT `acd_course_faculties`.* FROM `acd_course_faculties`  WHERE `acd_course_faculties`.`is_deleted` = 0
---
  def combo
    begin


        data =[]
        if !params[:type].nil? && params[:type] == "TC"

          # for TC degree
          if !params[:degree_id].nil?
            data = AcdDegreeCourse.joins(:acd_course_faculty).where(degree_id:params[:degree_id]).select("acd_course_faculties.*")
          elsif
            data = AcdDegreeCourse.joins(:acd_course_faculty).where("acd_course_faculties.course_type='TC'").select("acd_course_faculties.*")
          end


        elsif !params[:type].nil? && params[:type] == "WU" && !params[:degree_id].nil?

          data = AcdDegreeCourse.joins(:acd_course_faculty).where(degree_id:params[:degree_id]).select("acd_course_faculties.*")

        else
          data = AcdCourseFaculty.where(is_deleted:false)