app/controllers/acd_majors_controller.rb

	def combo
		data = AcdMajor.where(is_deleted:false, campus_id:session[:campus_id])
---
SELECT `acd_majors`.* FROM `acd_majors`  WHERE `acd_majors`.`is_deleted` = 0 AND `acd_majors`.`campus_id` = 1