app/controllers/acd_degree_setup_controller.rb

SELECT `acd_course_faculties`.* FROM `acd_course_faculties`  WHERE `acd_course_faculties`.`is_deleted` = 0 AND `acd_course_faculties`.`course_type` = 'TC'
---
	def getCourseTC
		condition = ''
		if !params[:keyword].nil?
			text = '%'+params[:keyword]+'%'
			condition = "code LIKE '#{text}'" + " OR name LIKE '#{text}'" +
			" OR abbr LIKE '#{text}'" + " OR course_type LIKE '#{text}'" + " OR khr_name LIKE '#{text}'"
		end
		puts("***************** #{condition}")

		data = AcdCourseFaculty.where(is_deleted:false,course_type:'TC')

SELECT `acd_course_faculties`.* FROM `acd_course_faculties`  WHERE `acd_course_faculties`.`is_deleted` = 0 AND `acd_course_faculties`.`course_type` = 'WU'
---
	def getCourseWU
		condition = ''
		if !params[:keyword].nil?
			text = '%'+params[:keyword]+'%'
			condition = "code LIKE '#{text}'" + " OR name LIKE '#{text}'" +
			" OR abbr LIKE '#{text}'" + " OR course_type LIKE '#{text}'" + " OR khr_name LIKE '#{text}'"
		end
		puts("***************** #{condition}")

		data = AcdCourseFaculty.where(is_deleted:false,course_type:'WU')