app/controllers/acd_tuition_times_controller.rb

	def combo
		data = 	AcdTuitionTime.all
---
SELECT `acd_tuition_times`.* FROM `acd_tuition_times`