app/controllers/cfg_religions_controller.rb

	def get_all

		data = CfgReligion.where(is_deleted:false)
---
SELECT `cfg_religions`.* FROM `cfg_religions`  WHERE `cfg_religions`.`is_deleted` = 0