app/controllers/cfg_academic_years_controller.rb

SELECT `cfg_academic_years`.* FROM `cfg_academic_years`  WHERE `cfg_academic_years`.`gen_campus_id` = 1
---
	def combo
		data = 	CfgAcademicYear.where( gen_campus_id: session[:campus_id] )