app/controllers/home_controller.rb

  def login
		@username = params[:userId]
  		if !@username.nil? && !params[:password].nil?

  			auditrail =AuditialController.new;

        user = SysUser.find_by(:user_id=> params[:userId])

        puts user




		if user && user.password == params[:password]

          campus = GenCampus.find_by(:id=>user.home_campus_id)
---
SELECT  `sys_users`.* FROM `sys_users`  WHERE `sys_users`.`user_id` = 'admin' LIMIT 1
SELECT  `gen_campus`.* FROM `gen_campus`  WHERE `gen_campus`.`id` = 1 LIMIT 1