app/controllers/hr_positions_controller.rb

	def create
		@data = HrPosition.new(permit_data)
		@data.is_deleted =false


	    if @data.save
---
INSERT INTO `hr_positions` (`created_at`, `description`, `is_deleted`, `position`, `updated_at`) VALUES ('2016-06-07 17:14:16', '', 0, 'Director, GEP', '2016-06-07 17:14:16')