app/controllers/sdn_drop_types_controller.rb

SELECT `sdn_drop_types`.* FROM `sdn_drop_types`  WHERE `sdn_drop_types`.`is_deleted` = 0  ORDER BY code
---
  def index
    data = SdnDropType.where(is_deleted:false).order('code')