app/controllers/sdn_student_controller.rb

	def index
		data = SdnStudent
		if !params[:string].nil?
			string = "%"+params[:string]+"%"

			data = data.where(" student_code like '#{string}' or student_no like '#{string}' or
			 first_name like '#{string}' or last_name like '#{string}' or khr_first_name like '#{string}' or khr_last_name like '#{string}' or phone like '#{string}' ")

		end

		if !params[:status].nil?
			data = data.where(" sdn_students.status = 'A' ")
		end
		@conditon_string = SdnStudentHelper.get_string_advance_search params
		data = data.where(" sdn_students.campus_id = #{session[:campus_id]} #{@conditon_string}")

		result = data.select("  sdn_students.* , sdn_city_states.city_name ,
				sdn_student_khrs.student_id,
				sdn_student_khrs.gender gender_khr,
				sdn_student_khrs.date_of_birth date_of_birth_khr,
				sdn_student_khrs.place_of_birth,
				sdn_student_khrs.address address_khr,
				sdn_student_khrs.phone,
				sdn_student_khrs.diploma_year,
				sdn_student_khrs.diploma_grade,
				sdn_student_khrs.total_score,
				sdn_student_khrs.is_passed_diploma,
				sdn_student_khrs.diploma_num,
				sdn_student_khrs.certificate,
				sdn_student_khrs.institue,
				sdn_student_khrs.institue_city,
				sdn_student_khrs.city,
				sdn_student_khrs.father_name,
				sdn_student_khrs.mother_name,
				sdn_student_khrs.occupation

			").joins(" left join sdn_city_states on sdn_city_states.id = sdn_students.from_city_id
---
SELECT COUNT(*) FROM `sdn_students` left join sdn_city_states on sdn_city_states.id = sdn_students.from_city_id