app/controllers/sdn_suspend_types_controller.rb

  def index
    data = SdnSuspendType.where(is_deleted:false).order('code')
---
SELECT `sdn_suspend_types`.* FROM `sdn_suspend_types`  WHERE `sdn_suspend_types`.`is_deleted` = 0  ORDER BY code