app/controllers/sdn_document_type_controller.rb

	def index
		data =SdnDocumentType.all
---
SELECT `sdn_document_types`.* FROM `sdn_document_types`