app/controllers/sdn_city_states_controller.rb

    def combo
      begin
        data = SdnCityState.where(is_deleted:false)
---
SELECT `sdn_city_states`.* FROM `sdn_city_states`  WHERE `sdn_city_states`.`is_deleted` = 0