app/controllers/security_controller.rb

	def menu_student
    user_id=session[:user_id]
    if user_id==1
      data= SysMenu.where(:module => 'Student').order(:order_val)
    else
      data= SysMenu.joins(:sys_shortcut_menu,:sys_role_user)
                   .select('sys_menus.*')
                   .where("sys_role_users.user_id=#{user_id} and sys_menus.shortcut_id=1")
---
SELECT `sys_menus`.* FROM `sys_menus`  WHERE `sys_menus`.`module` = 'Student'  ORDER BY `sys_menus`.`order_val` ASC
SELECT sys_menus.* FROM `sys_menus` INNER JOIN `sys_shortcut_menus` ON `sys_shortcut_menus`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_shortcut_menus` `sys_shortcut_menus_sys_menus_join` ON `sys_shortcut_menus_sys_menus_join`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_roles` ON `sys_roles`.`id` = `sys_shortcut_menus_sys_menus_join`.`role_id` INNER JOIN `sys_role_users` ON `sys_role_users`.`role_id` = `sys_roles`.`id` WHERE (sys_role_users.user_id=17 and sys_menus.shortcut_id=1)

  def menu_academic
    user_id=session[:user_id]
    if user_id==1
      data= SysMenu.where(:module => 'Academic').order(:order_val)
    else
      data= SysMenu.joins(:sys_shortcut_menu,:sys_role_user)
      .select('sys_menus.*')
      .where("sys_role_users.user_id=#{user_id} and sys_menus.shortcut_id=2")
---
SELECT `sys_menus`.* FROM `sys_menus`  WHERE `sys_menus`.`module` = 'Academic'  ORDER BY `sys_menus`.`order_val` ASC
SELECT sys_menus.* FROM `sys_menus` INNER JOIN `sys_shortcut_menus` ON `sys_shortcut_menus`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_shortcut_menus` `sys_shortcut_menus_sys_menus_join` ON `sys_shortcut_menus_sys_menus_join`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_roles` ON `sys_roles`.`id` = `sys_shortcut_menus_sys_menus_join`.`role_id` INNER JOIN `sys_role_users` ON `sys_role_users`.`role_id` = `sys_roles`.`id` WHERE (sys_role_users.user_id=17 and sys_menus.shortcut_id=2)

	def menu_admin
    user_id=session[:user_id]
    if user_id==1
      data= SysMenu.where(:module => 'Admin').order(:order_val)
    else
      data= SysMenu.joins(:sys_shortcut_menu,:sys_role_user)
      .select('sys_menus.*')
      .where("sys_role_users.user_id=#{user_id} and sys_menus.shortcut_id=7")
---
SELECT `sys_menus`.* FROM `sys_menus`  WHERE `sys_menus`.`module` = 'Admin'  ORDER BY `sys_menus`.`order_val` ASC
SELECT sys_menus.* FROM `sys_menus` INNER JOIN `sys_shortcut_menus` ON `sys_shortcut_menus`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_shortcut_menus` `sys_shortcut_menus_sys_menus_join` ON `sys_shortcut_menus_sys_menus_join`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_roles` ON `sys_roles`.`id` = `sys_shortcut_menus_sys_menus_join`.`role_id` INNER JOIN `sys_role_users` ON `sys_role_users`.`role_id` = `sys_roles`.`id` WHERE (sys_role_users.user_id=17 and sys_menus.shortcut_id=7)

  def menu_hr
    user_id=session[:user_id]
    if user_id ==1
      data= SysMenu.where(:module => 'HR').order(:order_val)
    else
      data= SysMenu.joins(:sys_shortcut_menu,:sys_role_user)
      .select('sys_menus.*')
      .where("sys_role_users.user_id=#{user_id} and sys_menus.shortcut_id=6")
---
SELECT `sys_menus`.* FROM `sys_menus`  WHERE `sys_menus`.`module` = 'HR'  ORDER BY `sys_menus`.`order_val` ASC
SELECT sys_menus.* FROM `sys_menus` INNER JOIN `sys_shortcut_menus` ON `sys_shortcut_menus`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_shortcut_menus` `sys_shortcut_menus_sys_menus_join` ON `sys_shortcut_menus_sys_menus_join`.`menu_id` = `sys_menus`.`id` INNER JOIN `sys_roles` ON `sys_roles`.`id` = `sys_shortcut_menus_sys_menus_join`.`role_id` INNER JOIN `sys_role_users` ON `sys_role_users`.`role_id` = `sys_roles`.`id` WHERE (sys_role_users.user_id=21 and sys_menus.shortcut_id=4)