app/controllers/shortcuts_controller.rb

SELECT `sys_shortcuts`.* FROM `sys_shortcuts`
---
  def index
=begin
    data = SysShortcut.find_by_sql("select s.* from sys_shortcuts s
          inner join sys_role_shortcuts rs on s.id=rs.shortcut_id
          inner join sys_role_users ru on rs.role_id=ru.role_id
          where ru.user_id=#{session[:user_id]}")
=end
    data = SysShortcut.all

SELECT  `sys_shortcuts`.* FROM `sys_shortcuts`  WHERE `sys_shortcuts`.`id` = 2 LIMIT 1
---
  def update

    SysShortcut.transaction do
      data = SysShortcut.find(params[:id])