app/controllers/sys_roles_controller.rb

SELECT  `sys_roles`.* FROM `sys_roles`  WHERE `sys_roles`.`id` = 14 LIMIT 1
UPDATE `sys_roles` SET `code` = 'FY', `description` = 'Role for  foundation year', `name` = 'Foundation Year ', `updated_at` = '2016-06-07 16:33:32' WHERE `sys_roles`.`id` = 14
---
  def update
    @data = SysRole.find((params[:id]))
    @data.update_attributes(permit_data)

SELECT sys_role_users.*, sys_users.user_name as name,sys_users.user_id as user_id_str FROM `sys_role_users` INNER JOIN `sys_users` ON `sys_users`.`id` = `sys_role_users`.`user_id` WHERE `sys_role_users`.`role_id` = 17
---
  def role_users
    role_id=params[:role_id]
    if !role_id.nil?
      data = SysRoleUser.joins(:sys_user).select("sys_role_users.*, sys_users.user_name as name,sys_users.user_id as user_id_str").where(role_id:role_id)

SELECT sys_shortcut_menus.*,sys_menus.name FROM `sys_shortcut_menus` INNER JOIN `sys_menus` ON `sys_menus`.`id` = `sys_shortcut_menus`.`menu_id` WHERE `sys_shortcut_menus`.`role_id` = 1 AND `sys_shortcut_menus`.`shortcut_id` = 2
---
  def role_module_menus
    begin
      role_id=params[:role_id]
      shortcut_id=params[:shortcut_id]
      if !role_id.nil? && !shortcut_id.nil?
        data = SysShortcutMenu.joins(:sys_menu).select("sys_shortcut_menus.*,sys_menus.name").where(role_id:role_id,shortcut_id:shortcut_id)

SELECT sys_role_shortcuts.*, sys_shortcuts.name FROM `sys_role_shortcuts` INNER JOIN `sys_shortcuts` ON `sys_shortcuts`.`id` = `sys_role_shortcuts`.`shortcut_id` WHERE `sys_role_shortcuts`.`role_id` = 17
---
  def role_modules

    role_id=params[:role_id]

    if !role_id.nil?
      data = SysRoleShortcut.joins(:sys_shortcut).select("sys_role_shortcuts.*, sys_shortcuts.name").where(role_id:role_id)

SELECT sys_menus.id,sys_menus.name FROM `sys_menus`  WHERE `sys_menus`.`shortcut_id` = 0
---
  def comboMenuByShortcut
    begin
      shortcut_id=params[:shortcut_id]
      if !shortcut_id.nil?
        data = SysMenu.select("sys_menus.id,sys_menus.name").where(shortcut_id:shortcut_id)