app/controllers/sys_users_controller.rb

SELECT  1 AS one FROM `sys_users`  WHERE `sys_users`.`user_id` = 'CKV001' LIMIT 1
INSERT INTO `sys_users` (`address`, `created_at`, `description`, `email`, `encrypted_password`, `home_campus_id`, `hr_department_id`, `hr_position_id`, `phone`, `start_date`, `status_id`, `updated_at`, `user_id`, `user_name`) VALUES ('', '2016-06-07 17:16:20', '', 'khanvisalchhin@yahoo.com', 'lC+HI813oC0JPEVWB73TgQ==\n', 1, 8, 18, '016335133', '2016-06-09', 29, '2016-06-07 17:16:20', 'CKV001', 'Chhin Khavisal')
---
	def create

    @data=params[:data]

    if !SysUser.exists?(user_id:@data[:user_id])
      @user = SysUser.new(permit_data)

      auditrail = AuditialController.new;
      if @user.save

SELECT sys_user_degrees.*,acd_degrees.name FROM `sys_user_degrees` INNER JOIN `acd_degrees` ON `acd_degrees`.`id` = `sys_user_degrees`.`degree_id` WHERE `sys_user_degrees`.`user_id` = 0
---
  def user_degrees
    user_id=params[:userId]
    if !user_id.nil?
      data = SysUserDegree.joins(:acd_degree).select("sys_user_degrees.*,acd_degrees.name").where(user_id:user_id)

SELECT sys_role_users.*, sys_roles.name FROM `sys_role_users` INNER JOIN `sys_roles` ON `sys_roles`.`id` = `sys_role_users`.`role_id` WHERE `sys_role_users`.`user_id` = 0
---
  def UserRoles
      user_id=params[:userId]
      if !user_id.nil?
          data = SysRoleUser.joins(:sys_role).select("sys_role_users.*, sys_roles.name").where(user_id:user_id)

SELECT sys_user_locations.*,gen_campus.campus_name as name FROM `sys_user_locations` INNER JOIN `gen_campus` ON `gen_campus`.`id` = `sys_user_locations`.`campus_id` WHERE `sys_user_locations`.`user_id` = 0
---
  def UserLocations
      user_id=params[:userId]
      if !user_id.nil?
        data = SysUserLocation.joins(:gen_campus).select("sys_user_locations.*,gen_campus.campus_name as name").where(user_id:user_id)